c = 0
for i in [int(i) for i in input().split()]:
    c += i
print(c)

# Напишите программу, на вход которой подается одна строка с целыми числами. Программа должна вывести сумму этих чисел.
# Используйте метод split строки.